{
  "about": {
    "paragraph1": "My name is Pham Giang Thai Duong, i am in my final year and waiting for graduation at the University of Science, VNU-HCM. Throughout my academic journey, I have honed my skills in TypeScript, React, Node.js, and Express.js, equipping me with a solid foundation for modern web development. I am particularly interested in Java, Spring Boot, and Microservices, and I am dedicated to building a successful career as a backend developer.",
    "paragraph2": "My ambition is to make meaningful contributions to large-scale, complex projects that tackle critical challenges in security, data management, and beyond. I am eager to leverage my knowledge and experience to create innovative solutions that drive progress and enhance user experiences.",
    "title": "About Me"
  },
  "ads-management": {
    "description": "This innovative application is crafted to revolutionize the management of advertising boards across City X. By addressing the needs of residents, local officials at both ward and district levels, and the Department of Culture and Sports, it offers a powerful, transparent, and efficient solution for overseeing the city's advertising landscape. Embrace this opportunity to enhance communication and engagement within our community.",
    "overview": {
      "frontend": {
        "overview-01": "",
        "overview-02": "",
        "overview-03": ""
      }
    },
    "technologies": {
      "backend": {
        "tech-01": "",
        "tech-02": "",
        "tech-03": "",
        "tech-04": "",
        "tech-05": "",
        "tech-06": ""
      },
      "frontend": {
        "tech-01": "",
        "tech-02": "",
        "tech-03": ""
      }
    }
  },
  "car-booking": {
    "description": "This revolutionary application, comparable to Uber and Grab, is purposefully crafted to transform the car booking experience for residents of City X. Utilizing the powerful capabilities of Flutter and React, it boasts intuitive mobile applications for both customers and drivers, alongside a user-friendly web platform for call center agents. Customers can effortlessly secure rides through the mobile app or by connecting with our attentive call center agents, ensuring a seamless and remarkable service that redefines convenience and efficiency.",
    "overview": {
      "call-center": {
        "overview-01": "",
        "overview-02": "",
        "overview-03": ""
      },
      "customer": {
        "overview-01": "",
        "overview-02": "",
        "overview-03": ""
      },
      "driver": {
        "overview-01": "",
        "overview-02": "",
        "overview-03": ""
      }
    },
    "technologies": {
      "backend": {
        "tech-01": "",
        "tech-02": "",
        "tech-03": "",
        "tech-04": "",
        "tech-05": ""
      },
      "mobile": {
        "tech-01": "",
        "tech-02": ""
      },
      "web": {
        "tech-01": "",
        "tech-02": "",
        "tech-03": ""
      }
    }
  },
  "chat-app": {
    "description": "Introducing a powerful real-time chat application that empowers users to effortlessly create chat rooms and communicate with one another. Developed using cutting-edge technologies such as React, Node.js, and Firebase Cloud, this application not only facilitates seamless messaging but also allows users to join dynamic chat rooms and easily access their chat history. Experience a new level of connectivity and interaction with our innovative platform!",
    "overview": {
      "frontend": {
        "overview-01": "Effortlessly locate any user by entering their name in the search bar. Take advantage of this simple feature to connect with the people you need!",
        "overview-02": "Effortlessly create a new chat room by simply initiating a conversation with a user you wish to chat with.",
        "overview-03": "You have the ability to effortlessly send text messages, captivating images, and expressive emojis."
      }
    },
    "technologies": {
      "frontend": {
        "tech-01": "Engineered with Node.js to deliver highly efficient and robust server-side operations, ensuring optimal performance and reliability.",
        "tech-02": "Leverages the power of React.js to deliver an engaging and highly responsive user interface that enhances the overall user experience.",
        "tech-03": "Leverages Firebase to enable seamless real-time chat and robust data storage solutions."
      }
    }
  },
  "coffee-order": {
    "description": "Introducing a powerful application crafted with Kotlin in Android Studio, JavaScript, and MySQL. This innovative platform not only enables users to effortlessly order their favorite coffee and customize their selections with a variety of toppings but also includes a robust administration panel for streamlined management. Experience convenience and control like never before!",
    "overview": {
      "frontend": {
        "overview-01": "Customers can effortlessly explore and select their ideal coffee from an extensive array of options, guaranteeing a personalized and truly delightful experience that will elevate their coffee journey.",
        "overview-02": "Users have the flexibility to customize their coffee order with a variety of toppings, allowing them to create the perfect beverage tailored to their preferences.",
        "overview-03": "The application supports seamless online payments through ZaloPay, providing a convenient and secure payment method for customers.",
        "overview-04": "Customers can effortlessly access their order history and quickly reorder their favorite coffee, making the entire ordering process not just seamless, but also incredibly convenient.",
        "overview-05": "Customers receive real-time notifications about their order status, ensuring they are always informed and updated."
      }
    },
    "technologies": {
      "backend": {
        "tech-01": "Built with Express.js to ensure efficient and robust server-side operations, delivering optimal performance and reliability.",
        "tech-02": "Developed with Node.js to provide a high-performance backend infrastructure, ensuring scalability and speed.",
        "tech-03": "Utilizes MySQL for reliable and efficient data storage solutions, ensuring data integrity and accessibility.",
        "tech-04": "Incorporates Socket.IO to deliver real-time notifications, keeping customers informed about their order status."
      },
      "frontend": {
        "tech-01": "Developed using Android Studio to create a seamless and intuitive mobile application experience.",
        "tech-02": "Integrates ZaloPay to provide a secure and convenient online payment solution for customers."
      }
    }
  },
  "contact": {
    "description": "Contact me via phone number or email",
    "email": "Email Address",
    "phone": "Phone Number",
    "title": "Contact"
  },
  "education": {
    "award1": "Awarded the university's Academic Encouragement Scholarship for the 2021-2022 academic year.",
    "certificate1": "Microsoft Office Specialist (MOS) certification (2019)",
    "certificate2": "IELTS 6.0 (2025)",
    "certificates": "Certificates",
    "degree": "Bachelor of Software Engineering",
    "gpa": "GPA: 3.48/4.0",
    "title": "Education",
    "university": "University of Science, VNU-HCM"
  },
  "fam-fund": {
    "description": "Introducing a powerful financial management application designed to help families track their expenses, set budgets, and achieve their financial goals. This intuitive tool empowers users to manage their finances effectively, visualize their spending habits, and make informed financial decisions. With features for expense tracking, budgeting, and goal setting, this application is your trusted companion for financial success. Additionally, it includes features for scheduling, education management for kids, news updates, a chat function to keep the family connected and informed, etc.",
    "overview": {
      "admin": {
        "overview-01": "",
        "overview-02": "",
        "overview-03": ""
      },
      "mobile": {
        "overview-01": "",
        "overview-02": "",
        "overview-03": ""
      },
      "web": {
        "overview-01": "",
        "overview-02": "",
        "overview-03": ""
      }
    },
    "technologies": {
      "backend": {
        "tech-01": "",
        "tech-02": "",
        "tech-03": ""
      },
      "mobile": {
        "tech-01": "",
        "tech-02": "",
        "tech-03": ""
      },
      "web": {
        "tech-01": "",
        "tech-02": "",
        "tech-03": ""
      }
    }
  },
  "footer": {
    "copyright": "Copyright © 2025 Duong Pham. All rights reserved",
    "design": "Designed and developed by Duong Pham",
    "title": "Duong Pham"
  },
  "home": {
    "contact": "Contact Me",
    "description": "I am a software engineer with a passion for building web applications and solving problems. I have experience working with JavaScript, TypeScript, React, Node.js, and more.",
    "greeting": "Hi there!",
    "job": "a Software Engineer",
    "projects": "My Projects",
    "pronouns": "I'm"
  },
  "hotel-booking": {
    "description": "This innovative web application revolutionizes the way users book hotel rooms with unmatched ease and efficiency. Developed with cutting-edge technologies like React, Node.js, Express.js, and MongoDB, it offers a seamless user experience. Guests can effortlessly explore a wide selection of available rooms, secure their reservations instantly, and conveniently track their booking history—all in one place. Furthermore, the powerful admin panel empowers administrators to effectively manage room inventory and bookings, ensuring a smooth operation. Experience the future of hotel booking with this exceptional application!",
    "overview": {
      "frontend": {
        "overview-01": "Discover the convenience of exploring hotel apartments without the need to log in. However, to secure your booking and enjoy a seamless experience, simply log in when you're ready to reserve your room.",
        "overview-02": "Guests have the opportunity to rate the hotel apartments using a star system and share insightful comments about their stay, helping future visitors make informed choices. Your valuable feedback can significantly enhance the experience for everyone!",
        "overview-03": "Hotel managers and owners have the opportunity to enhance their visibility and attract more guests by requesting access to list their business on our website. With this access, they can easily add rooms, apartments, and additional offerings, maximizing their potential for bookings and ensuring a seamless guest experience. ",
        "overview-04": "Hotel managers and owners have the valuable capability to access and review the comprehensive list of customer bookings, empowering them to enhance service and optimize operations.",
        "overview-05": "Administrators play a crucial role in effectively managing accounts and decisively approving business requests, ensuring seamless operations and fostering growth."
      }
    },
    "technologies": {
      "backend": {
        "tech-01": "Designed with Express.js, this framework guarantees exceptional efficiency and robust server-side operations, delivering unparalleled performance and unwavering reliability.",
        "tech-02": "Developed with Node.js, this application delivers a robust and high-performance backend infrastructure, ensuring scalability and speed to meet the demands of modern applications.",
        "tech-03": "Leverages MongoDB to provide highly flexible and scalable data storage solutions, ensuring your data management needs are met with efficiency and reliability."
      },
      "frontend": {
        "tech-01": "Harnesses the power of Material UI to craft an engaging and highly responsive user interface that captivates users and enhances their experience.",
        "tech-02": "Leverages the power of React.js to deliver an engaging and highly responsive user interface that enhances the overall user experience."
      }
    }
  },
  "list": {
    "about": "About",
    "contact": "Contact",
    "education": "Education",
    "experience": "Experience",
    "home": "Home",
    "projects": "Projects"
  },
  "metadata": {
    "description": "Duong Pham's personal website",
    "title": "Duong Pham"
  },
  "my-shop": {
    "description": "Introducing a powerful Windows application expertly developed using C#, WPF, and MSSQL Server, designed to streamline your management of computer and PC products and orders. With this innovative tool, users can effortlessly apply discounts and gain valuable insights through comprehensive sales statistics, empowering you to optimize your business operations and drive success.",
    "overview": {
      "frontend": {
        "overview-01": "",
        "overview-02": "",
        "overview-03": ""
      }
    },
    "technologies": {
      "frontend": {
        "tech-01": "",
        "tech-02": "",
        "tech-03": ""
      }
    }
  },
  "navbar": {
    "title": "Duong Pham"
  },
  "online-academy": {
    "description": "Introducing an innovative online learning platform, expertly crafted with Handlebars, Express, and MongoDB. This application empowers learners by offering a diverse range of courses across multiple subjects. Users can easily enroll in courses, access a wealth of engaging course materials, and enhance their knowledge through interactive quizzes and assignments. Transform your learning experience and achieve your educational goals with us!",
    "overview": {
      "frontend": {
        "overview-01": "Students can effortlessly enroll in courses and unlock a treasure trove of engaging and enriching course materials.",
        "overview-02": "By actively engaging in assignments and quizzes, students can significantly enhance their learning experience and deepen their understanding of the material.",
        "overview-03": "Educators can effortlessly upload and update courses, guaranteeing that the content is not only current but also highly relevant to students' needs. This empowers teachers to enhance the learning experience and ensure their materials are always impactful.",
        "overview-04": "Teachers can engage students by asking thought-provoking questions and providing constructive feedback, thereby cultivating a dynamic and collaborative learning environment.",
        "overview-05": "Administrators play a pivotal role in enhancing the learning experience by effectively managing courses, users, and content. Their oversight ensures a seamless and engaging educational environment for everyone involved."
      }
    },
    "technologies": {
      "frontend": {
        "tech-01": "Harnesses the power of Handlebars to craft dynamic and highly efficient templates that elevate the user interface experience.",
        "tech-02": "The design leverages Bootstrap to create a dynamic and visually stunning experience, ensuring that it is both responsive and engaging for users.",
        "tech-03": "Harnesses the power of MongoDB to deliver highly flexible and scalable data storage solutions that adapt to your evolving needs."
      }
    }
  },
  "paint-app": {
    "description": "Introducing a powerful drawing application inspired by the beloved Windows Paint. This intuitive tool empowers users to unleash their creativity, offering features for drawing, erasing, changing colors, and seamlessly saving their artwork. Built with cutting-edge technology using C#, WPF, and XAML, this application is designed to enhance your artistic experience and bring your visions to life.",
    "overview": {
      "frontend": {
        "overview-01": "Users can effortlessly draw various shapes such as rectangles, circles, and lines, utilizing a plugin architecture that enhances flexibility and functionality.",
        "overview-02": "Users have the ability to rotate shapes, change their size, and modify the color of lines, providing a highly customizable drawing experience.",
        "overview-03": "The application allows users to change the type of outline, choose outline thickness, and apply different styles to their drawings.",
        "overview-04": "Users can easily undo, redo, duplicate, copy, and paste elements, ensuring a seamless and efficient drawing process.",
        "overview-05": "The intuitive interface and robust features make it easy for users to create and manage their artwork, enhancing their overall creative experience."
      }
    },
    "technologies": {
      "frontend": {
        "tech-01": "Harnesses the power of WPF to deliver a highly responsive and visually appealing user interface, enhancing the overall user experience."
      }
    }
  },
  "projects": {
    "description": "Here is a detailed list of personal and team projects that I have successfully contributed to.",
    "title": "Projects"
  },
  "video-sharing": {
    "description": "Introducing a cutting-edge video-sharing platform developed with the latest technologies, including React, Node.js, Express.js, and MongoDB. Users can effortlessly upload their videos, engage with content through likes and shares, and subscribe to their favorite channels. This innovative application is a powerful clone of YouTube, designed to enhance your video-sharing experience and foster a vibrant online community. Join us and be a part of this dynamic platform!",
    "overview": {
      "frontend": {
        "overview-01": "Seamlessly upload your videos and instantly connect with the community by sharing your creativity!",
        "overview-02": "Amplify your experience by actively engaging with the content through likes, shares, and comments. Your participation makes a difference!",
        "overview-03": "Enhance your experience and never miss out on fresh content by subscribing to your favorite channels."
      }
    },
    "technologies": {
      "backend": {
        "tech-01": "Designed with Express.js, this framework guarantees exceptional efficiency and robust server-side operations, delivering unparalleled performance and unwavering reliability.",
        "tech-02": "Developed with Node.js, this application delivers a robust and high-performance backend infrastructure, ensuring scalability and speed to meet the demands of modern applications.",
        "tech-03": "Leverages MongoDB to provide highly flexible and scalable data storage solutions, ensuring your data management needs are met with efficiency and reliability."
      },
      "frontend": {
        "tech-01": "Harnesses the power of Material UI to craft an engaging and highly responsive user interface that captivates users and enhances their experience.",
        "tech-02": "Harnessing the power of React.js, we deliver an engaging and interactive user experience that captivates and retains users.",
        "tech-03": "Leverages Firebase to deliver effortless real-time data synchronization and powerful backend services, ensuring an exceptional user experience and reliability."
      }
    }
  }
}
