{
  "metadata": {
    "title": "Duong Pham",
    "description": "Duong Pham's personal website"
  },
  "navbar": {
    "title": "Duong Pham"
  },
  "footer": {
    "title": "Duong Pham",
    "design": "Designed and developed by Duong Pham",
    "copyright": "Copyright © 2025 Duong Pham. All rights reserved"
  },
  "list": {
    "home": "Home",
    "about": "About",
    "education": "Education",
    "experience": "Experience",
    "projects": "Projects",
    "contact": "Contact"
  },
  "contact": {
    "title": "Contact",
    "description": "Contact me via phone number or email",
    "email": "Email Address",
    "phone": "Phone Number"
  },
  "home": {
    "greeting": "Hi there!",
    "pronouns": "I'm",
    "job": "a Software Engineer",
    "description": "I am a software engineer with a passion for building web applications and solving problems. I have experience working with JavaScript, TypeScript, React, Node.js, and more.",
    "projects": "My Projects",
    "contact": "Contact Me"
  },
  "about": {
    "title": "About Me",
    "paragraph1": "My name is Pham Giang Thai Duong, i am in my final year and waiting for graduation at the University of Science, VNU-HCM. Throughout my academic journey, I have honed my skills in TypeScript, React, Node.js, and Express.js, equipping me with a solid foundation for modern web development. I am particularly interested in Java, Spring Boot, and Microservices, and I am dedicated to building a successful career as a backend developer.",
    "paragraph2": "My ambition is to make meaningful contributions to large-scale, complex projects that tackle critical challenges in security, data management, and beyond. I am eager to leverage my knowledge and experience to create innovative solutions that drive progress and enhance user experiences."
  },
  "education": {
    "title": "Education",
    "degree": "Bachelor of Software Engineering",
    "university": "University of Science, VNU-HCM",
    "gpa": "GPA: 3.48/4.0",
    "award1": "Awarded the university's Academic Encouragement Scholarship for the 2021-2022 academic year.",
    "certificates": "Certificates",
    "certificate1": "Microsoft Office Specialist (MOS) certification (2019)",
    "certificate2": "IELTS 6.0 (2025)"
  },
  "projects": {
    "title": "Projects",
    "description": "Here is a detailed list of personal and team projects that I have successfully contributed to."
  },
  "paint-app": {
    "description": "Introducing a powerful drawing application inspired by the beloved Windows Paint. This intuitive tool empowers users to unleash their creativity, offering features for drawing, erasing, changing colors, and seamlessly saving their artwork. Built with cutting-edge technology using C#, WPF, and XAML, this application is designed to enhance your artistic experience and bring your visions to life."
  },
  "my-shop": {
    "description": "Introducing a powerful Windows application expertly developed using C#, WPF, and MSSQL Server, designed to streamline your management of computer and PC products and orders. With this innovative tool, users can effortlessly apply discounts and gain valuable insights through comprehensive sales statistics, empowering you to optimize your business operations and drive success."
  },
  "hotel-booking": {
    "description": "This innovative web application revolutionizes the way users book hotel rooms with unmatched ease and efficiency. Developed with cutting-edge technologies like React, Node.js, Express.js, and MongoDB, it offers a seamless user experience. Guests can effortlessly explore a wide selection of available rooms, secure their reservations instantly, and conveniently track their booking history—all in one place. Furthermore, the powerful admin panel empowers administrators to effectively manage room inventory and bookings, ensuring a smooth operation. Experience the future of hotel booking with this exceptional application!"
  },
  "chat-app": {
    "description": "Introducing a powerful real-time chat application that empowers users to effortlessly create chat rooms and communicate with one another. Developed using cutting-edge technologies such as React, Node.js, and Firebase Cloud, this application not only facilitates seamless messaging but also allows users to join dynamic chat rooms and easily access their chat history. Experience a new level of connectivity and interaction with our innovative platform!"
  },
  "video-sharing": {
    "description": "Introducing a cutting-edge video-sharing platform developed with the latest technologies, including React, Node.js, Express.js, and MongoDB. Users can effortlessly upload their videos, engage with content through likes and shares, and subscribe to their favorite channels. This innovative application is a powerful clone of YouTube, designed to enhance your video-sharing experience and foster a vibrant online community. Join us and be a part of this dynamic platform!"
  },
  "online-academy": {
    "description": "Introducing an innovative online learning platform, expertly crafted with Handlebars, Express, and MongoDB. This application empowers learners by offering a diverse range of courses across multiple subjects. Users can easily enroll in courses, access a wealth of engaging course materials, and enhance their knowledge through interactive quizzes and assignments. Transform your learning experience and achieve your educational goals with us!"
  },
  "coffee-order": {
    "description": "Introducing a powerful application crafted with Kotlin in Android Studio, JavaScript, and MySQL. This innovative platform not only enables users to effortlessly order their favorite coffee and customize their selections with a variety of toppings but also includes a robust administration panel for streamlined management. Experience convenience and control like never before!"
  },
  "ads-management": {
    "description": "This innovative application is crafted to revolutionize the management of advertising boards across City X. By addressing the needs of residents, local officials at both ward and district levels, and the Department of Culture and Sports, it offers a powerful, transparent, and efficient solution for overseeing the city's advertising landscape. Embrace this opportunity to enhance communication and engagement within our community."
  },
  "car-booking": {
    "description": "This revolutionary application, comparable to Uber and Grab, is purposefully crafted to transform the car booking experience for residents of City X. Utilizing the powerful capabilities of Flutter and React, it boasts intuitive mobile applications for both customers and drivers, alongside a user-friendly web platform for call center agents. Customers can effortlessly secure rides through the mobile app or by connecting with our attentive call center agents, ensuring a seamless and remarkable service that redefines convenience and efficiency."

  }
}
