{
  "metadata": {
    "title": "Dương Phạm",
    "description": "Trang web cá nhân của Dương Phạm"
  },
  "navbar": {
    "title": "Dương Phạm"
  },
  "footer": {
    "title": "Dương Phạm",
    "design": "Thiết kế và phát triển bởi Dương Phạm",
    "copyright": "Bản quyền © 2025 Dương Phạm. Tất cả các quyền được bảo lưu"
  },
  "list": {
    "home": "Trang chủ",
    "about": "Giới thiệu",
    "education": "Học vấn",
    "experience": "Kinh nghiệm",
    "projects": "Dự án",
    "contact": "Liên hệ"
  },
  "contact": {
    "title": "Liên hệ",
    "description": "Hãy liên hệ với tôi qua số điện thoại hoặc email",
    "email": "Địa chỉ Email",
    "phone": "Số điện thoại"
  },
  "home": {
    "greeting": "Xin chào!",
    "pronouns": "Tôi là",
    "job": "một Kỹ sư Phần mềm",
    "description": "Tôi là một kỹ sư phần mềm với niềm đam mê xây dựng ứng dụng web và giải quyết vấn đề. Tôi có kinh nghiệm làm việc với JavaScript, TypeScript, React, Node.js, và nhiều công nghệ khác.",
    "projects": "Dự án",
    "contact": "Liên hệ"
  },
  "about": {
    "title": "Về tôi",
    "paragraph1": "Tên tôi là Phạm Giang Thái Dương, tôi hiện là sinh viên năm cuối và đang chờ tốt nghiệp tại Đại học Khoa học Tự nhiên, ĐHQG-HCM. Trong suốt hành trình học tập của mình, tôi đã rèn luyện kỹ năng với TypeScript, React, Node.js, và Express.js, trang bị cho mình nền tảng vững chắc cho phát triển web hiện đại. Tôi đặc biệt quan tâm đến Java, Spring Boot, và Microservices, và tôi mong muốn xây dựng một sự nghiệp thành công với vai trò là một lập trình viên backend.",
    "paragraph2": "Hoài bão của tôi là đóng góp ý nghĩa vào các dự án lớn, phức tạp giải quyết các thách thức quan trọng về bảo mật, quản lý dữ liệu, và hơn thế nữa. Tôi rất háo hức sử dụng kiến thức và kinh nghiệm của mình để tạo ra những giải pháp sáng tạo nhằm thúc đẩy tiến bộ và nâng cao trải nghiệm người dùng."
  },
  "education": {
    "title": "Học vấn",
    "degree": "Cử nhân Kỹ thuật Phần mềm",
    "university": "Đại học Khoa học Tự nhiên, ĐHQG-HCM",
    "gpa": "Điểm trung bình: 3.48/4.0",
    "award1": "Được trao Học bổng Khuyến khích Học tập của trường đại học cho năm học 2021-2022.",
    "certificates": "Chứng chỉ",
    "certificate1": "Chứng chỉ Microsoft Office Specialist (MOS) (2019)",
    "certificate2": "IELTS 6.0 (2025)"
  },
  "projects": {
    "title": "Dự án",
    "description": "Dưới đây là danh sách chi tiết các dự án cá nhân và dự án nhóm mà tôi đã đóng góp."
  },
  "paint-app": {
    "description": "Một ứng dụng vẽ đơn giản dựa trên Windows Paint. Nó cho phép người dùng vẽ, xóa, thay đổi màu sắc, và lưu tác phẩm của mình. Ứng dụng được xây dựng bằng C#, WPF, và XAML."
  },
  "my-shop": {
    "description": "Một ứng dụng Windows được xây dựng bằng C#, WPF và MSSQL Server. Ứng dụng này giúp quản lý sản phẩm và đơn hàng của máy tính và PC. Người dùng có thể cung cấp các chương trình giảm giá và xem thống kê bán hàng."
  },
  "hotel-booking": {
    "description": "Một ứng dụng web cho phép người dùng đặt phòng khách sạn. Ứng dụng được xây dựng bằng React, Node.js, Express.js, và MongoDB. Người dùng có thể xem phòng có sẵn, đặt phòng, và xem lịch sử đặt phòng của họ. Ứng dụng cũng bao gồm một trang điều khiển quản trị để quản lý các phòng và đặt chỗ."
  },
  "chat-app": {
    "description": "Một ứng dụng chat realtime cho phép người dùng trò chuyện với nhau. Ứng dụng được xây dựng bằng React, Node.js, Firebase Cloud. Người dùng có thể tạo phòng chat, tham gia phòng chat, và gửi tin nhắn."
  },
  "video-sharing": {
    "description": "Một nền tảng chia sẻ video được xây dựng bằng React, Node.js, Express.js và MongoDB. Người dùng có thể tải lên video, thích, chia sẻ và đăng ký kênh. Ứng dụng này được sao chép từ YouTube."
  },
  "online-academy": {
    "description": "Một nền tảng học trực tuyến được xây dựng bằng Handlebars, Express và MongoDB. Ứng dụng này cung cấp các khóa học về nhiều chủ đề khác nhau, cho phép người dùng đăng ký khóa học, xem tài liệu học tập và hoàn thành các bài kiểm tra và bài tập."
  },
  "coffee-order": {
    "description": "Giới thiệu một ứng dụng mạnh mẽ được tạo ra bằng Kotlin trong Android Studio, JavaScript và MySQL. Nền tảng sáng tạo này không chỉ cho phép người dùng dễ dàng đặt cà phê yêu thích và tùy chỉnh lựa chọn với nhiều loại topping mà còn bao gồm một bảng quản trị mạnh mẽ để quản lý hiệu quả. Trải nghiệm sự tiện lợi và kiểm soát chưa từng có!"
  },
  "ads-management": {
    "description": "Ứng dụng sáng tạo này được thiết kế để cách mạng hóa việc quản lý các bảng quảng cáo trên toàn thành phố X. Bằng cách đáp ứng nhu cầu của cư dân, các quan chức địa phương ở cả cấp phường và quận, và Sở Văn hóa và Thể thao, nó cung cấp một giải pháp mạnh mẽ, minh bạch và hiệu quả để giám sát cảnh quan quảng cáo của thành phố. Hãy nắm bắt cơ hội này để nâng cao giao tiếp và sự tham gia trong cộng đồng của chúng ta."
  }
}
