{
  "about": {
    "paragraph1": "Tên tôi là Phạm Giang Thái Dương, tôi hiện là sinh viên năm cuối và đang chờ tốt nghiệp tại Đại học Khoa học Tự nhiên, ĐHQG-HCM. Trong suốt hành trình học tập của mình, tôi đã rèn luyện kỹ năng với TypeScript, React, Node.js, và Express.js, trang bị cho mình nền tảng vững chắc cho phát triển web hiện đại. Tôi đặc biệt quan tâm đến Java, Spring Boot, và Microservices, và tôi mong muốn xây dựng một sự nghiệp thành công với vai trò là một lập trình viên backend.",
    "paragraph2": "Hoài bão của tôi là đóng góp ý nghĩa vào các dự án lớn, phức tạp giải quyết các thách thức quan trọng về bảo mật, quản lý dữ liệu, và hơn thế nữa. Tôi rất háo hức sử dụng kiến thức và kinh nghiệm của mình để tạo ra những giải pháp sáng tạo nhằm thúc đẩy tiến bộ và nâng cao trải nghiệm người dùng.",
    "title": "Về tôi"
  },
  "ads-management": {
    "description": "Ứng dụng sáng tạo này được chế tác để cách mạng hóa việc quản lý các bảng quảng cáo trên toàn Thành phố X. Bằng cách đáp ứng nhu cầu của cư dân, các quan chức địa phương ở cả cấp phường và quận, và Sở Văn hóa và Thể thao, nó cung cấp một giải pháp mạnh mẽ, minh bạch và hiệu quả để giám sát cảnh quan quảng cáo của thành phố. Nắm bắt cơ hội này để nâng cao giao tiếp và sự tham gia trong cộng đồng của chúng ta.",
    "overview": {
      "frontend": {
        "overview-01": "",
        "overview-02": "",
        "overview-03": ""
      }
    },
    "technologies": {
      "backend": {
        "tech-01": "",
        "tech-02": "",
        "tech-03": "",
        "tech-04": "",
        "tech-05": "",
        "tech-06": ""
      },
      "frontend": {
        "tech-01": "",
        "tech-02": "",
        "tech-03": ""
      }
    }
  },
  "car-booking": {
    "description": "Ứng dụng cách mạng này, tương tự như Uber và Grab, được chế tác đặc biệt để biến đổi trải nghiệm đặt xe cho cư dân Thành phố X. Sử dụng các khả năng mạnh mẽ của Flutter và React, nó có các ứng dụng di động trực quan cho cả khách hàng và tài xế, cùng với một nền tảng web thân thiện với người dùng cho các đại lý trung tâm cuộc gọi. Khách hàng có thể dễ dàng đặt xe thông qua ứng dụng di động hoặc bằng cách kết nối với các đại lý trung tâm cuộc gọi tận tâm của chúng tôi, đảm bảo một dịch vụ liền mạch và đáng chú ý, định nghĩa lại sự tiện lợi và hiệu quả.",
    "overview": {
      "call-center": {
        "overview-01": "",
        "overview-02": "",
        "overview-03": ""
      },
      "customer": {
        "overview-01": "",
        "overview-02": "",
        "overview-03": ""
      },
      "driver": {
        "overview-01": "",
        "overview-02": "",
        "overview-03": ""
      }
    },
    "technologies": {
      "backend": {
        "tech-01": "",
        "tech-02": "",
        "tech-03": "",
        "tech-04": "",
        "tech-05": ""
      },
      "mobile": {
        "tech-01": "",
        "tech-02": ""
      },
      "web": {
        "tech-01": "",
        "tech-02": "",
        "tech-03": ""
      }
    }
  },
  "chat-app": {
    "description": "Giới thiệu một ứng dụng trò chuyện thời gian thực mạnh mẽ cho phép người dùng dễ dàng tạo phòng trò chuyện và giao tiếp với nhau. Được phát triển bằng các công nghệ tiên tiến như React, Node.js và Firebase Cloud, ứng dụng này không chỉ tạo điều kiện nhắn tin liền mạch mà còn cho phép người dùng tham gia các phòng trò chuyện động và dễ dàng truy cập lịch sử trò chuyện của họ. Trải nghiệm một mức độ kết nối và tương tác mới với nền tảng sáng tạo của chúng tôi!",
    "overview": {
      "frontend": {
        "overview-01": "Dễ dàng tìm bất kỳ người dùng nào bằng cách nhập tên của họ vào thanh tìm kiếm. Tận dụng tính năng đơn giản này để kết nối với những người bạn cần!",
        "overview-02": "Dễ dàng tạo phòng trò chuyện mới chỉ bằng cách bắt đầu cuộc trò chuyện với người dùng bạn muốn trò chuyện.",
        "overview-03": "Bạn có thể dễ dàng gửi tin nhắn văn bản, hình ảnh hấp dẫn và biểu tượng cảm xúc sinh động."
      }
    },
    "technologies": {
      "frontend": {
        "tech-01": "Được xây dựng với Node.js để cung cấp các hoạt động phía máy chủ hiệu quả và mạnh mẽ, đảm bảo hiệu suất và độ tin cậy tối ưu.",
        "tech-02": "Tận dụng sức mạnh của React.js để cung cấp giao diện người dùng hấp dẫn và phản hồi nhanh, nâng cao trải nghiệm người dùng tổng thể.",
        "tech-03": "Sử dụng Firebase để cho phép trò chuyện thời gian thực liền mạch và các giải pháp lưu trữ dữ liệu mạnh mẽ."
      }
    }
  },
  "coffee-order": {
    "description": "Giới thiệu một ứng dụng mạnh mẽ được chế tác bằng Kotlin trong Android Studio, JavaScript và MySQL. Nền tảng sáng tạo này không chỉ cho phép người dùng dễ dàng đặt hàng cà phê yêu thích của họ và tùy chỉnh lựa chọn của họ với nhiều loại topping mà còn bao gồm một bảng điều khiển quản trị mạnh mẽ để quản lý hợp lý. Trải nghiệm sự tiện lợi và kiểm soát chưa từng có!",
    "overview": {
      "frontend": {
        "overview-01": "Khách hàng có thể dễ dàng khám phá và chọn cà phê lý tưởng của mình từ một loạt các tùy chọn, đảm bảo một trải nghiệm cá nhân hóa và thực sự thú vị sẽ nâng cao hành trình cà phê của họ.",
        "overview-02": "Người dùng có thể tùy chỉnh đơn hàng cà phê của mình với nhiều loại topping, cho phép họ tạo ra đồ uống hoàn hảo phù hợp với sở thích của mình.",
        "overview-03": "Ứng dụng hỗ trợ thanh toán trực tuyến liền mạch thông qua ZaloPay, cung cấp một phương thức thanh toán tiện lợi và an toàn cho khách hàng.",
        "overview-04": "Khách hàng có thể dễ dàng truy cập lịch sử đơn hàng của mình và nhanh chóng đặt lại cà phê yêu thích của họ, làm cho toàn bộ quá trình đặt hàng không chỉ liền mạch mà còn vô cùng tiện lợi.",
        "overview-05": "Khách hàng nhận được thông báo thời gian thực về trạng thái đơn hàng của họ, đảm bảo họ luôn được thông báo và cập nhật."
      }
    },
    "technologies": {
      "backend": {
        "tech-01": "Được xây dựng với Express.js để đảm bảo các hoạt động phía máy chủ hiệu quả và mạnh mẽ, mang lại hiệu suất và độ tin cậy tối ưu.",
        "tech-02": "Được phát triển với Node.js để cung cấp cơ sở hạ tầng backend hiệu suất cao, đảm bảo khả năng mở rộng và tốc độ.",
        "tech-03": "Sử dụng MySQL để cung cấp các giải pháp lưu trữ dữ liệu đáng tin cậy và hiệu quả, đảm bảo tính toàn vẹn và khả năng truy cập dữ liệu.",
        "tech-04": "Tích hợp Socket.IO để cung cấp thông báo thời gian thực, giữ cho khách hàng luôn được thông báo về trạng thái đơn hàng của họ."
      },
      "frontend": {
        "tech-01": "Được phát triển bằng Android Studio để tạo ra trải nghiệm ứng dụng di động liền mạch và trực quan.",
        "tech-02": "Tích hợp ZaloPay để cung cấp giải pháp thanh toán trực tuyến an toàn và tiện lợi cho khách hàng."
      }
    }
  },
  "contact": {
    "description": "Hãy liên hệ với tôi qua số điện thoại hoặc email",
    "email": "Địa chỉ Email",
    "phone": "Số điện thoại",
    "title": "Liên hệ"
  },
  "education": {
    "award1": "Được trao Học bổng Khuyến khích Học tập của trường đại học cho năm học 2021-2022.",
    "certificate1": "Chứng chỉ Microsoft Office Specialist (MOS) (2019)",
    "certificate2": "IELTS 6.0 (2025)",
    "certificates": "Chứng chỉ",
    "degree": "Cử nhân Kỹ thuật Phần mềm",
    "gpa": "Điểm trung bình: 3.48/4.0",
    "title": "Học vấn",
    "university": "Đại học Khoa học Tự nhiên, ĐHQG-HCM"
  },
  "fam-fund": {
    "description": "Giới thiệu một ứng dụng quản lý tài chính mạnh mẽ được thiết kế để giúp các gia đình theo dõi chi tiêu, lập ngân sách và đạt được các mục tiêu tài chính của họ. Công cụ trực quan này cho phép người dùng quản lý tài chính hiệu quả, hình dung thói quen chi tiêu và đưa ra các quyết định tài chính thông minh. Với các tính năng theo dõi chi tiêu, lập ngân sách và đặt mục tiêu, ứng dụng này là người bạn đồng hành đáng tin cậy của bạn để đạt được thành công tài chính. Ngoài ra, nó còn bao gồm các tính năng lập lịch, quản lý giáo dục cho trẻ em, cập nhật tin tức, chức năng trò chuyện để giữ cho gia đình luôn kết nối và thông tin, v.v."
  },
  "footer": {
    "copyright": "Bản quyền © 2025 Dương Phạm. Tất cả các quyền được bảo lưu",
    "design": "Thiết kế và phát triển bởi Dương Phạm",
    "title": "Dương Phạm"
  },
  "home": {
    "contact": "Liên hệ",
    "description": "Tôi là một kỹ sư phần mềm với niềm đam mê xây dựng ứng dụng web và giải quyết vấn đề. Tôi có kinh nghiệm làm việc với JavaScript, TypeScript, React, Node.js, và nhiều công nghệ khác.",
    "greeting": "Xin chào!",
    "job": "một Kỹ sư Phần mềm",
    "projects": "Dự án",
    "pronouns": "Tôi là"
  },
  "hotel-booking": {
    "description": "Ứng dụng web sáng tạo này cách mạng hóa cách người dùng đặt phòng khách sạn với sự dễ dàng và hiệu quả vượt trội. Được phát triển bằng các công nghệ tiên tiến như React, Node.js, Express.js và MongoDB, nó mang lại trải nghiệm người dùng liền mạch. Khách hàng có thể dễ dàng khám phá một loạt các phòng có sẵn, đặt chỗ ngay lập tức và theo dõi lịch sử đặt phòng của họ - tất cả trong một nơi. Hơn nữa, bảng điều khiển quản trị mạnh mẽ cho phép quản trị viên quản lý hiệu quả kho phòng và đặt phòng, đảm bảo hoạt động suôn sẻ. Trải nghiệm tương lai của việc đặt phòng khách sạn với ứng dụng xuất sắc này!",
    "overview": {
      "frontend": {
        "overview-01": "Khám phá sự tiện lợi của việc khám phá các căn hộ khách sạn mà không cần đăng nhập. Tuy nhiên, để đảm bảo đặt phòng của bạn và tận hưởng trải nghiệm liền mạch, chỉ cần đăng nhập khi bạn sẵn sàng đặt phòng.",
        "overview-02": "Khách có thể đánh giá các căn hộ khách sạn bằng hệ thống sao và chia sẻ nhận xét chi tiết về kỳ nghỉ của họ, giúp những khách hàng tương lai đưa ra quyết định sáng suốt. Phản hồi quý giá của bạn có thể cải thiện trải nghiệm cho mọi người!",
        "overview-03": "Quản lý và chủ khách sạn có cơ hội nâng cao khả năng hiển thị và thu hút nhiều khách hàng hơn bằng cách yêu cầu quyền truy cập để liệt kê doanh nghiệp của họ trên trang web của chúng tôi. Với quyền truy cập này, họ có thể dễ dàng thêm phòng, căn hộ và các dịch vụ bổ sung, tối đa hóa tiềm năng đặt phòng và đảm bảo trải nghiệm khách hàng liền mạch.",
        "overview-04": "Quản lý và chủ khách sạn có khả năng truy cập và xem danh sách đầy đủ các đặt phòng của khách hàng, giúp họ cải thiện dịch vụ và tối ưu hóa hoạt động.",
        "overview-05": "Quản trị viên đóng vai trò quan trọng trong việc quản lý tài khoản và phê duyệt các yêu cầu kinh doanh một cách quyết đoán, đảm bảo hoạt động suôn sẻ và thúc đẩy sự phát triển."
      }
    },
    "technologies": {
      "backend": {
        "tech-01": "Được thiết kế với Express.js, framework này đảm bảo hiệu quả vượt trội và các hoạt động phía máy chủ mạnh mẽ, mang lại hiệu suất không thể so sánh và độ tin cậy không ngừng.",
        "tech-02": "Được phát triển với Node.js, ứng dụng này cung cấp cơ sở hạ tầng backend mạnh mẽ và hiệu suất cao, đảm bảo khả năng mở rộng và tốc độ để đáp ứng nhu cầu của các ứng dụng hiện đại.",
        "tech-03": "Sử dụng MongoDB để cung cấp các giải pháp lưu trữ dữ liệu linh hoạt và có khả năng mở rộng cao, đảm bảo nhu cầu quản lý dữ liệu của bạn được đáp ứng một cách hiệu quả và đáng tin cậy."
      },
      "frontend": {
        "tech-01": "Tận dụng sức mạnh của Material UI để tạo ra giao diện người dùng hấp dẫn và phản hồi nhanh, nâng cao trải nghiệm của người dùng.",
        "tech-02": "Tận dụng sức mạnh của React.js để cung cấp giao diện người dùng hấp dẫn và phản hồi nhanh, nâng cao trải nghiệm người dùng tổng thể."
      }
    }
  },
  "list": {
    "about": "Giới thiệu",
    "contact": "Liên hệ",
    "education": "Học vấn",
    "experience": "Kinh nghiệm",
    "home": "Trang chủ",
    "projects": "Dự án"
  },
  "metadata": {
    "description": "Trang web cá nhân của Dương Phạm",
    "title": "Dương Phạm"
  },
  "my-shop": {
    "description": "Giới thiệu một ứng dụng Windows mạnh mẽ được phát triển chuyên nghiệp bằng C#, WPF và MSSQL Server, được thiết kế để tối ưu hóa việc quản lý sản phẩm và đơn hàng máy tính và PC của bạn. Với công cụ sáng tạo này, người dùng có thể dễ dàng áp dụng giảm giá và có được thông tin chi tiết có giá trị thông qua thống kê bán hàng toàn diện, giúp bạn tối ưu hóa hoạt động kinh doanh và thúc đẩy thành công.",
    "overview": {
      "frontend": {
        "overview-01": "",
        "overview-02": "",
        "overview-03": ""
      }
    },
    "technologies": {
      "frontend": {
        "tech-01": "",
        "tech-02": "",
        "tech-03": ""
      }
    }
  },
  "navbar": {
    "title": "Dương Phạm"
  },
  "online-academy": {
    "description": "Giới thiệu một nền tảng học trực tuyến sáng tạo, được chế tác chuyên nghiệp bằng Handlebars, Express và MongoDB. Ứng dụng này cung cấp cho người học một loạt các khóa học đa dạng trên nhiều chủ đề. Người dùng có thể dễ dàng đăng ký các khóa học, truy cập một kho tài liệu khóa học phong phú và nâng cao kiến thức của họ thông qua các bài kiểm tra và bài tập tương tác. Biến đổi trải nghiệm học tập của bạn và đạt được mục tiêu giáo dục của bạn với chúng tôi!",
    "overview": {
      "frontend": {
        "overview-01": "Học viên có thể dễ dàng đăng ký các khóa học và mở khóa kho tài liệu khóa học phong phú và hấp dẫn.",
        "overview-02": "Bằng cách tích cực tham gia vào các bài tập và bài kiểm tra, học viên có thể nâng cao trải nghiệm học tập của mình và hiểu sâu hơn về tài liệu.",
        "overview-03": "Giáo viên có thể dễ dàng tải lên và cập nhật các khóa học, đảm bảo rằng nội dung không chỉ hiện tại mà còn rất phù hợp với nhu cầu của học viên. Điều này giúp giáo viên nâng cao trải nghiệm học tập và đảm bảo tài liệu của họ luôn có tác động.",
        "overview-04": "Giáo viên có thể tương tác với học viên bằng cách đặt câu hỏi gợi mở và cung cấp phản hồi mang tính xây dựng, từ đó tạo ra một môi trường học tập năng động và hợp tác.",
        "overview-05": "Quản trị viên đóng vai trò then chốt trong việc nâng cao trải nghiệm học tập bằng cách quản lý hiệu quả các khóa học, người dùng và nội dung. Sự giám sát của họ đảm bảo một môi trường giáo dục liền mạch và hấp dẫn cho tất cả mọi người tham gia."
      }
    },
    "technologies": {
      "frontend": {
        "tech-01": "Tận dụng sức mạnh của Handlebars để tạo ra các mẫu động và hiệu quả cao, nâng cao trải nghiệm giao diện người dùng.",
        "tech-02": "Thiết kế tận dụng Bootstrap để tạo ra trải nghiệm động và trực quan, đảm bảo rằng nó vừa phản hồi vừa hấp dẫn đối với người dùng.",
        "tech-03": "Tận dụng sức mạnh của MongoDB để cung cấp các giải pháp lưu trữ dữ liệu linh hoạt và có khả năng mở rộng cao, đáp ứng nhu cầu phát triển của bạn."
      }
    }
  },
  "paint-app": {
    "description": "Giới thiệu một ứng dụng vẽ mạnh mẽ lấy cảm hứng từ Windows Paint yêu thích. Công cụ trực quan này cho phép người dùng thỏa sức sáng tạo, cung cấp các tính năng vẽ, xóa, thay đổi màu sắc và lưu tác phẩm nghệ thuật của họ một cách liền mạch. Được xây dựng bằng công nghệ tiên tiến sử dụng C#, WPF và XAML, ứng dụng này được thiết kế để nâng cao trải nghiệm nghệ thuật của bạn và biến tầm nhìn của bạn thành hiện thực.",
    "overview": {
      "frontend": {
        "overview-01": "Người dùng có thể dễ dàng vẽ các hình dạng khác nhau như hình chữ nhật, hình tròn và đường thẳng, sử dụng kiến trúc plugin để tăng cường tính linh hoạt và chức năng.",
        "overview-02": "Người dùng có khả năng xoay hình dạng, thay đổi kích thước và thay đổi màu sắc của các đường, cung cấp trải nghiệm vẽ tùy chỉnh cao.",
        "overview-03": "Ứng dụng cho phép người dùng thay đổi loại viền, chọn độ dày viền và áp dụng các kiểu khác nhau cho bản vẽ của họ.",
        "overview-04": "Người dùng có thể dễ dàng hoàn tác, làm lại, sao chép, sao chép và dán các yếu tố, đảm bảo quá trình vẽ liền mạch và hiệu quả.",
        "overview-05": "Giao diện trực quan và các tính năng mạnh mẽ giúp người dùng dễ dàng tạo và quản lý tác phẩm nghệ thuật của họ, nâng cao trải nghiệm sáng tạo tổng thể của họ."
      }
    },
    "technologies": {
      "frontend": {
        "tech-01": "Tận dụng sức mạnh của WPF để cung cấp giao diện người dùng hấp dẫn và phản hồi nhanh, nâng cao trải nghiệm người dùng tổng thể."
      }
    }
  },
  "projects": {
    "description": "Dưới đây là danh sách chi tiết các dự án cá nhân và dự án nhóm mà tôi đã đóng góp.",
    "title": "Dự án"
  },
  "video-sharing": {
    "description": "Giới thiệu một nền tảng chia sẻ video tiên tiến được phát triển bằng các công nghệ mới nhất, bao gồm React, Node.js, Express.js và MongoDB. Người dùng có thể dễ dàng tải lên video của họ, tương tác với nội dung thông qua lượt thích và chia sẻ, và đăng ký các kênh yêu thích của họ. Ứng dụng sáng tạo này là một bản sao mạnh mẽ của YouTube, được thiết kế để nâng cao trải nghiệm chia sẻ video của bạn và tạo ra một cộng đồng trực tuyến sôi động. Tham gia với chúng tôi và trở thành một phần của nền tảng năng động này!",
    "overview": {
      "frontend": {
        "overview-01": "Dễ dàng tải lên video của bạn và kết nối ngay lập tức với cộng đồng bằng cách chia sẻ sự sáng tạo của bạn!",
        "overview-02": "Tăng cường trải nghiệm của bạn bằng cách tích cực tương tác với nội dung thông qua lượt thích, chia sẻ và bình luận. Sự tham gia của bạn tạo nên sự khác biệt!",
        "overview-03": "Nâng cao trải nghiệm của bạn và không bỏ lỡ nội dung mới bằng cách đăng ký các kênh yêu thích của bạn."
      }
    },
    "technologies": {
      "backend": {
        "tech-01": "Được thiết kế với Express.js, framework này đảm bảo hiệu quả vượt trội và các hoạt động phía máy chủ mạnh mẽ, mang lại hiệu suất không thể so sánh và độ tin cậy không ngừng.",
        "tech-02": "Được phát triển với Node.js, ứng dụng này cung cấp cơ sở hạ tầng backend mạnh mẽ và hiệu suất cao, đảm bảo khả năng mở rộng và tốc độ để đáp ứng nhu cầu của các ứng dụng hiện đại.",
        "tech-03": "Sử dụng MongoDB để cung cấp các giải pháp lưu trữ dữ liệu linh hoạt và có khả năng mở rộng cao, đảm bảo nhu cầu quản lý dữ liệu của bạn được đáp ứng một cách hiệu quả và đáng tin cậy."
      },
      "frontend": {
        "tech-01": "Tận dụng sức mạnh của Material UI để tạo ra giao diện người dùng hấp dẫn và phản hồi nhanh, nâng cao trải nghiệm của người dùng.",
        "tech-02": "Tận dụng sức mạnh của React.js, chúng tôi cung cấp trải nghiệm người dùng tương tác và hấp dẫn, thu hút và giữ chân người dùng.",
        "tech-03": "Sử dụng Firebase để cung cấp đồng bộ hóa dữ liệu thời gian thực dễ dàng và các dịch vụ backend mạnh mẽ, đảm bảo trải nghiệm người dùng tuyệt vời và độ tin cậy."
      }
    }
  }
}
