{
  "about": {
    "paragraph1": "Tên tôi là Phạm Giang Thái Dương, tôi hiện là sinh viên năm cuối và đang chờ tốt nghiệp tại Đại học Khoa học Tự nhiên, ĐHQG-HCM. Trong suốt hành trình học tập của mình, tôi đã rèn luyện kỹ năng với TypeScript, React, Node.js, và Express.js, trang bị cho mình nền tảng vững chắc cho phát triển web hiện đại. Tôi đặc biệt quan tâm đến Java, Spring Boot, và Microservices, và tôi mong muốn xây dựng một sự nghiệp thành công với vai trò là một lập trình viên backend.",
    "paragraph2": "Hoài bão của tôi là đóng góp ý nghĩa vào các dự án lớn, phức tạp giải quyết các thách thức quan trọng về bảo mật, quản lý dữ liệu, và hơn thế nữa. Tôi rất háo hức sử dụng kiến thức và kinh nghiệm của mình để tạo ra những giải pháp sáng tạo nhằm thúc đẩy tiến bộ và nâng cao trải nghiệm người dùng.",
    "title": "Về tôi"
  },
  "ads-management": {
    "description": "Ứng dụng sáng tạo này được chế tác để cách mạng hóa việc quản lý các bảng quảng cáo trên toàn Thành phố X. Bằng cách đáp ứng nhu cầu của cư dân, các quan chức địa phương ở cả cấp phường và quận, và Sở Văn hóa và Thể thao, nó cung cấp một giải pháp mạnh mẽ, minh bạch và hiệu quả để giám sát cảnh quan quảng cáo của thành phố. Nắm bắt cơ hội này để nâng cao giao tiếp và sự tham gia trong cộng đồng của chúng ta.",
    "overview": {
      "frontend": {
        "overview-01": "Có hai ứng dụng web thiết yếu được thiết kế để tăng cường sự tham gia và tối ưu hóa giao tiếp: một ứng dụng dành riêng cho công dân và cư dân, và ứng dụng còn lại hỗ trợ các cán bộ phường và quận, cũng như các quan chức từ Sở Văn hóa và Thể thao. Những nền tảng này nhằm mục đích trao quyền cho người dùng và tạo điều kiện hợp tác hiệu quả trong cộng đồng.",
        "overview-02": "Công dân có cơ hội khám phá các địa điểm có hợp đồng thuê quảng cáo, truy cập các thông tin chi tiết như vị trí, thời gian và các công ty đang thuê. Ngoài ra, họ được khuyến khích báo cáo bất kỳ vấn đề nào gặp phải với các quảng cáo này, giúp duy trì một quy trình thuê minh bạch và hiệu quả. Sự tham gia của bạn tạo nên sự khác biệt!",
        "overview-03": "Cán bộ có thể liên hệ với các công ty và doanh nghiệp để tạo điều kiện thuê không gian quảng cáo. Họ chịu trách nhiệm quản lý các địa điểm này, giải quyết bất kỳ vấn đề nào được báo cáo và tham vấn với các quan chức từ Sở Văn hóa và Thể thao để xác nhận liệu công ty có được phép thuê các không gian này hay không.",
        "overview-04": "Các quan chức từ Sở Văn hóa và Thể thao có quyền kiểm soát toàn bộ hệ thống, bao gồm quản lý danh sách các quận, phường, loại quảng cáo và địa điểm quảng cáo. Họ có quyền truy cập vào các thống kê liên quan đến các báo cáo và tình trạng xử lý từ các cấp thấp hơn. Ngoài ra, việc tạo tài khoản và phân công khu vực để quản lý cũng được quản lý dễ dàng."
      }
    },
    "technologies": {
      "backend": {
        "tech-01": "Được xây dựng với Express.js để đảm bảo các hoạt động phía máy chủ hiệu quả và mạnh mẽ, mang lại hiệu suất và độ tin cậy tối ưu.",
        "tech-02": "Được phát triển với Node.js để cung cấp cơ sở hạ tầng backend hiệu suất cao, đảm bảo khả năng mở rộng và tốc độ.",
        "tech-03": "Sử dụng MongoDB để cung cấp các giải pháp lưu trữ dữ liệu đáng tin cậy và hiệu quả, đảm bảo tính toàn vẹn và khả năng truy cập dữ liệu.",
        "tech-04": "Tích hợp Socket.IO để cung cấp thông báo thời gian thực, giữ cho người dùng luôn được thông báo về các cập nhật.",
        "tech-05": "Sử dụng Jenkins cho tích hợp liên tục và triển khai liên tục, đảm bảo quy trình làm việc mượt mà và tự động.",
        "tech-06": "Docker được sử dụng để container hóa, đảm bảo môi trường nhất quán trên các giai đoạn phát triển, kiểm thử và sản xuất."
      },
      "frontend": {
        "tech-01": "Tận dụng sức mạnh của React.js để cung cấp giao diện người dùng hấp dẫn và phản hồi nhanh, nâng cao trải nghiệm người dùng tổng thể.",
        "tech-02": "Tận dụng sức mạnh của Material UI để tạo ra giao diện người dùng hấp dẫn và phản hồi nhanh, thu hút người dùng và nâng cao trải nghiệm của họ.",
        "tech-03": "Sử dụng Leaflet.js cho các bản đồ tương tác, cho phép người dùng xem và tương tác với các địa điểm quảng cáo."
      }
    }
  },
  "car-booking": {
    "description": "Ứng dụng cách mạng này, tương tự như Uber và Grab, được chế tác đặc biệt để biến đổi trải nghiệm đặt xe cho cư dân Thành phố X. Sử dụng các khả năng mạnh mẽ của Flutter và React, nó có các ứng dụng di động trực quan cho cả khách hàng và tài xế, cùng với một nền tảng web thân thiện với người dùng cho các đại lý trung tâm cuộc gọi. Khách hàng có thể dễ dàng đặt xe thông qua ứng dụng di động hoặc bằng cách kết nối với các đại lý trung tâm cuộc gọi tận tâm của chúng tôi, đảm bảo một dịch vụ liền mạch và đáng chú ý, định nghĩa lại sự tiện lợi và hiệu quả.",
    "overview": {
      "call-center": {
        "overview-01": "Trung tâm cuộc gọi là giải pháp lý tưởng cho khách hàng không có ứng dụng. Chỉ cần một cuộc gọi điện thoại đơn giản, bạn có thể dễ dàng đặt xe, đảm bảo trải nghiệm mượt mà và tiện lợi.",
        "overview-02": "Khi bạn gọi đến trung tâm của chúng tôi, một nhân viên tận tâm sẽ nhanh chóng hỗ trợ bạn. Họ sẽ thu thập thông tin cần thiết, bao gồm tên của bạn, địa điểm đón, địa điểm trả khách và loại xe ưa thích, đảm bảo quy trình đặt xe liền mạch và hiệu quả cho sự tiện lợi của bạn.",
        "overview-03": "Hệ thống sẽ chọn tài xế như thường lệ, đảm bảo trải nghiệm mượt mà và hiệu quả cho khách hàng. Họ sẽ nhanh chóng nhận được thông báo trên điện thoại, rõ ràng cho biết liệu đặt xe của họ đã được chấp nhận hay bị từ chối."
      },
      "customer": {
        "overview-01": "Để sử dụng dịch vụ của chúng tôi, người dùng cần tạo tài khoản bằng số điện thoại của họ. Bạn có thể dễ dàng đặt xe thông qua ứng dụng di động thân thiện với người dùng của chúng tôi hoặc bằng cách liên hệ với trung tâm cuộc gọi tận tâm của chúng tôi.",
        "overview-02": "Người dùng có thể dễ dàng đặt xe với các tùy chọn cho 4 hoặc 7 chỗ ngồi để phù hợp hoàn hảo với nhu cầu của họ. Giá cả của chúng tôi minh bạch và cạnh tranh, điều chỉnh dựa trên khoảng cách, thời gian trong ngày và nhu cầu giờ cao điểm, đảm bảo bạn nhận được giá trị tốt nhất cho hành trình của mình.",
        "overview-03": "Người dùng có thể dễ dàng theo dõi vị trí của tài xế theo thời gian thực, đảm bảo sự an tâm và tăng cường sự tin tưởng trong hành trình.",
        "overview-04": "Người dùng phải chọn thanh toán bằng tiền mặt hoặc qua ZaloPay. Quy trình thanh toán của chúng tôi an toàn và hiệu quả, đảm bảo trải nghiệm giao dịch liền mạch.",
        "overview-05": "Khách hàng có thể tận dụng các ưu đãi độc quyền để nâng cao trải nghiệm đặt xe của họ.",
        "overview-06": "Người dùng có cơ hội dễ dàng xem lịch sử đặt xe của họ và chia sẻ phản hồi bằng cách đánh giá tài xế của họ, đảm bảo trải nghiệm được tùy chỉnh và hài lòng hơn."
      },
      "driver": {
        "overview-01": "Tài xế có tùy chọn thuận tiện để dễ dàng cập nhật tên, thông tin xe và chi tiết giấy phép lái xe trực tiếp qua ứng dụng, đảm bảo hồ sơ của họ luôn chính xác và cập nhật.",
        "overview-02": "Tài xế ngay lập tức nhận được thông báo trong ứng dụng của họ bất cứ khi nào có người đặt dịch vụ của họ, cho phép họ dễ dàng chấp nhận hoặc từ chối đặt xe. Tính năng này đảm bảo họ có toàn quyền kiểm soát lịch trình của mình và có thể ưu tiên các chuyến đi phù hợp nhất với nhu cầu của họ.",
        "overview-03": "Tài xế có thể dễ dàng nhận đặt xe qua trung tâm cuộc gọi, cho phép họ truy cập thuận tiện vào lịch sử đặt xe và đánh giá của mình. Quy trình hợp lý này đảm bảo rằng họ luôn được thông báo và tham gia vào hiệu suất của mình.",
        "overview-04": "Ứng dụng theo dõi vị trí của tài xế trong suốt hành trình, đảm bảo họ đi đúng hướng và mang lại sự an tâm. Với tính năng sáng tạo này, tài xế có thể tự tin điều hướng mà không lo bị lạc.",
        "overview-05": "Tài xế có thể dễ dàng xem thu nhập của mình qua ví điện tử, đảm bảo tính minh bạch và cung cấp cái nhìn tổng quan rõ ràng về hiệu suất tài chính của họ."
      },
      "s2-geometry": {
        "overview-01": "Thuật toán S2-geometry được sử dụng để chọn tài xế tốt nhất cho khách hàng dựa trên vị trí của họ. Thuật toán này chia bề mặt Trái Đất thành một hệ thống các ô phân cấp, cho phép lập chỉ mục không gian chính xác và có thể mở rộng.",
        "overview-02": "Khi khách hàng yêu cầu một chuyến đi, thuật toán sẽ xác định ô tương ứng với vị trí của khách hàng và tìm kiếm các tài xế có sẵn trong các ô lân cận. Điều này đảm bảo rằng việc tìm kiếm vừa hiệu quả vừa chính xác, giảm thiểu thời gian tìm kiếm tài xế phù hợp.",
        "overview-03": "Bằng cách tận dụng thuật toán S2-geometry, hệ thống có thể nhanh chóng kết nối khách hàng với các tài xế gần nhất, tối ưu hóa trải nghiệm đặt xe tổng thể và giảm thời gian chờ đợi."
      }
    },
    "technologies": {
      "backend": {
        "tech-01": "Được xây dựng với Express.js để đảm bảo các hoạt động phía máy chủ hiệu quả và mạnh mẽ, mang lại hiệu suất và độ tin cậy tối ưu.",
        "tech-02": "Tích hợp Socket.IO để cung cấp thông báo thời gian thực, giữ cho người dùng luôn được thông báo về trạng thái chuyến đi của họ.",
        "tech-03": "Sử dụng MongoDB để cung cấp các giải pháp lưu trữ dữ liệu đáng tin cậy và hiệu quả, đảm bảo tính toàn vẹn và khả năng truy cập dữ liệu.",
        "tech-04": "Tích hợp RabbitMQ để cung cấp hàng đợi tin nhắn mạnh mẽ, đảm bảo giao tiếp mượt mà giữa các dịch vụ.",
        "tech-05": "Docker được sử dụng để container hóa, đảm bảo môi trường nhất quán trên các giai đoạn phát triển, kiểm thử và sản xuất."
      },
      "mobile": {
        "tech-01": "Được phát triển bằng Flutter để tạo ra trải nghiệm ứng dụng di động liền mạch và trực quan.",
        "tech-02": "Tích hợp Google Maps để cung cấp theo dõi vị trí và điều hướng chính xác.",
        "tech-03": "Tích hợp ZaloPay để cung cấp giải pháp thanh toán trực tuyến an toàn và tiện lợi cho khách hàng."
      },
      "web": {
        "tech-01": "Tận dụng sức mạnh của React.js để cung cấp giao diện người dùng hấp dẫn và phản hồi nhanh, nâng cao trải nghiệm người dùng tổng thể.",
        "tech-02": "Tận dụng sức mạnh của Material UI để tạo ra giao diện người dùng hấp dẫn và phản hồi nhanh, thu hút người dùng và nâng cao trải nghiệm của họ.",
        "tech-03": "Tích hợp Socket.IO để cung cấp thông báo thời gian thực, giữ cho người dùng luôn được thông báo về trạng thái chuyến đi của họ."
      }
    }
  },
  "chat-app": {
    "description": "Giới thiệu một ứng dụng trò chuyện thời gian thực mạnh mẽ cho phép người dùng dễ dàng tạo phòng trò chuyện và giao tiếp với nhau. Được phát triển bằng các công nghệ tiên tiến như React, Node.js và Firebase Cloud, ứng dụng này không chỉ tạo điều kiện nhắn tin liền mạch mà còn cho phép người dùng tham gia các phòng trò chuyện động và dễ dàng truy cập lịch sử trò chuyện của họ. Trải nghiệm một mức độ kết nối và tương tác mới với nền tảng sáng tạo của chúng tôi!",
    "overview": {
      "frontend": {
        "overview-01": "Dễ dàng tìm bất kỳ người dùng nào bằng cách nhập tên của họ vào thanh tìm kiếm. Tận dụng tính năng đơn giản này để kết nối với những người bạn cần!",
        "overview-02": "Dễ dàng tạo phòng trò chuyện mới chỉ bằng cách bắt đầu cuộc trò chuyện với người dùng bạn muốn trò chuyện.",
        "overview-03": "Bạn có thể dễ dàng gửi tin nhắn văn bản, hình ảnh hấp dẫn và biểu tượng cảm xúc sinh động."
      }
    },
    "technologies": {
      "frontend": {
        "tech-01": "Được xây dựng với Node.js để cung cấp các hoạt động phía máy chủ hiệu quả và mạnh mẽ, đảm bảo hiệu suất và độ tin cậy tối ưu.",
        "tech-02": "Tận dụng sức mạnh của React.js để cung cấp giao diện người dùng hấp dẫn và phản hồi nhanh, nâng cao trải nghiệm người dùng tổng thể.",
        "tech-03": "Sử dụng Firebase để cho phép trò chuyện thời gian thực liền mạch và các giải pháp lưu trữ dữ liệu mạnh mẽ."
      }
    }
  },
  "coffee-order": {
    "description": "Giới thiệu một ứng dụng mạnh mẽ được chế tác bằng Kotlin trong Android Studio, JavaScript và MySQL. Nền tảng sáng tạo này không chỉ cho phép người dùng dễ dàng đặt hàng cà phê yêu thích của họ và tùy chỉnh lựa chọn của họ với nhiều loại topping mà còn bao gồm một bảng điều khiển quản trị mạnh mẽ để quản lý hợp lý. Trải nghiệm sự tiện lợi và kiểm soát chưa từng có!",
    "overview": {
      "frontend": {
        "overview-01": "Khách hàng có thể dễ dàng khám phá và chọn cà phê lý tưởng của mình từ một loạt các tùy chọn, đảm bảo một trải nghiệm cá nhân hóa và thực sự thú vị sẽ nâng cao hành trình cà phê của họ.",
        "overview-02": "Người dùng có thể tùy chỉnh đơn hàng cà phê của mình với nhiều loại topping, cho phép họ tạo ra đồ uống hoàn hảo phù hợp với sở thích của mình.",
        "overview-03": "Ứng dụng hỗ trợ thanh toán trực tuyến liền mạch thông qua ZaloPay, cung cấp một phương thức thanh toán tiện lợi và an toàn cho khách hàng.",
        "overview-04": "Khách hàng có thể dễ dàng truy cập lịch sử đơn hàng của mình và nhanh chóng đặt lại cà phê yêu thích của họ, làm cho toàn bộ quá trình đặt hàng không chỉ liền mạch mà còn vô cùng tiện lợi.",
        "overview-05": "Khách hàng nhận được thông báo thời gian thực về trạng thái đơn hàng của họ, đảm bảo họ luôn được thông báo và cập nhật."
      }
    },
    "technologies": {
      "backend": {
        "tech-01": "Được xây dựng với Express.js để đảm bảo các hoạt động phía máy chủ hiệu quả và mạnh mẽ, mang lại hiệu suất và độ tin cậy tối ưu.",
        "tech-02": "Được phát triển với Node.js để cung cấp cơ sở hạ tầng backend hiệu suất cao, đảm bảo khả năng mở rộng và tốc độ.",
        "tech-03": "Sử dụng MySQL để cung cấp các giải pháp lưu trữ dữ liệu đáng tin cậy và hiệu quả, đảm bảo tính toàn vẹn và khả năng truy cập dữ liệu.",
        "tech-04": "Tích hợp Socket.IO để cung cấp thông báo thời gian thực, giữ cho khách hàng luôn được thông báo về trạng thái đơn hàng của họ."
      },
      "frontend": {
        "tech-01": "Được phát triển bằng Android Studio để tạo ra trải nghiệm ứng dụng di động liền mạch và trực quan.",
        "tech-02": "Tích hợp ZaloPay để cung cấp giải pháp thanh toán trực tuyến an toàn và tiện lợi cho khách hàng."
      }
    }
  },
  "company-01": {
    "description": "Đã hoàn thành thành công kỳ thực tập kỹ sư phần mềm, tích lũy kinh nghiệm thực tế trong phát triển full-stack, sử dụng ASP.NET cho dịch vụ backend và Vue.js để xây dựng giao diện người dùng động, phản hồi nhanh.",
    "duration": "Tháng 03/2025 - Tháng 05/2025"
  },
  "contact": {
    "description": "Hãy liên hệ với tôi qua số điện thoại hoặc email",
    "email": "Địa chỉ Email",
    "phone": "Số điện thoại",
    "title": "Liên hệ"
  },
  "education": {
    "award1": "Được trao Học bổng Khuyến khích Học tập của trường đại học cho năm học 2021-2022.",
    "certificate1": "Chứng chỉ Microsoft Office Specialist (MOS) (2019)",
    "certificate2": "IELTS 6.0 (2025)",
    "certificates": "Chứng chỉ",
    "degree": "Cử nhân Kỹ thuật Phần mềm",
    "gpa": "Điểm trung bình: 3.48/4.0",
    "title": "Học vấn",
    "university": "Đại học Khoa học Tự nhiên, ĐHQG-HCM"
  },
  "experience": {
    "description": "Dưới đây là danh sách chi tiết về kinh nghiệm làm việc của tôi.",
    "title": "Kinh nghiệm làm việc"
  },
  "fam-fund": {
    "description": "Giới thiệu một ứng dụng quản lý tài chính mạnh mẽ được thiết kế để giúp các gia đình theo dõi chi tiêu, lập ngân sách và đạt được các mục tiêu tài chính của họ. Công cụ trực quan này cho phép người dùng quản lý tài chính hiệu quả, hình dung thói quen chi tiêu và đưa ra các quyết định tài chính thông minh. Với các tính năng theo dõi chi tiêu, lập ngân sách và đặt mục tiêu, ứng dụng này là người bạn đồng hành đáng tin cậy của bạn để đạt được thành công tài chính. Ngoài ra, nó còn bao gồm các tính năng lập lịch, quản lý giáo dục cho trẻ em, cập nhật tin tức, chức năng trò chuyện để giữ cho gia đình luôn kết nối và thông tin, v.v.",
    "overview": {
      "admin": {
        "overview-01": "Quản lý tài khoản người dùng và phản hồi, đảm bảo trải nghiệm người dùng mượt mà và hiệu quả.",
        "overview-02": "Quản lý các gói thanh toán mà người dùng có thể mua để truy cập các tính năng bổ sung.",
        "overview-03": "Theo dõi dữ liệu proxy, bao gồm số lượng người dùng truy cập ứng dụng, yêu cầu theo quốc gia và yêu cầu theo trình duyệt.",
        "overview-04": "Xem nhật ký để giám sát các hoạt động của ứng dụng và khắc phục sự cố.",
        "overview-05": "Xem các truy vấn cơ sở dữ liệu để theo dõi số lần cơ sở dữ liệu được truy vấn, đảm bảo hiệu suất tối ưu."
      },
      "mobile": {
        "overview-01": "Ứng dụng này được thiết kế đặc biệt cho các gia đình, cho phép mỗi thành viên dễ dàng tham gia nhóm gia đình của họ và mở khóa nhiều tính năng hấp dẫn. Trải nghiệm lợi ích của sự gắn kết khi bạn kết nối, chia sẻ và tận dụng tối đa những gì ứng dụng mang lại!",
        "overview-02": "Các thành viên trong gia đình có thể quản lý tài chính hiệu quả bằng cách theo dõi thu nhập và chi tiêu từ nhiều nguồn khác nhau, bao gồm lương, tiền thuê, mua sắm, hóa đơn và nhiều hơn nữa. Cách tiếp cận toàn diện này không chỉ thúc đẩy nhận thức về tài chính mà còn giúp các gia đình đưa ra quyết định chi tiêu thông minh.",
        "overview-03": "Ứng dụng cung cấp một lịch gia đình động, tương tự như Google Calendar, có thể truy cập bởi tất cả các thành viên trong gia đình. Với các thông báo kịp thời về các sự kiện sắp tới, nó đảm bảo rằng mọi người đều được thông báo và tổ chức, làm cho việc phối hợp gia đình trở nên dễ dàng và hiệu quả.",
        "overview-04": "Cha mẹ có thể tích cực tham gia và giám sát hành trình giáo dục của con cái, theo dõi chặt chẽ các môn học, học kỳ và điểm số để đảm bảo sự thành công của chúng.",
        "overview-05": "Ứng dụng cung cấp các cập nhật tin tức kịp thời, đảm bảo rằng các gia đình luôn được thông báo về các phát triển quan trọng và thông tin liên quan.",
        "overview-06": "Tính năng trò chuyện gia đình cho phép các thành viên tương tác và kết nối với nhau, tăng cường giao tiếp và củng cố mối quan hệ gia đình."
      },
      "web": {
        "overview-01": "Ứng dụng web cung cấp các tính năng tương tự như ứng dụng di động, mang lại trải nghiệm liền mạch cho việc quản lý tài chính gia đình, lập lịch, giáo dục, cập nhật tin tức và giao tiếp gia đình.",
        "overview-02": "Người dùng có thể truy cập và quản lý dữ liệu tài chính của họ, theo dõi chi tiêu và thu nhập, và lập ngân sách từ sự tiện lợi của trình duyệt web.",
        "overview-03": "Nền tảng web bao gồm một lịch gia đình, cho phép các thành viên xem và quản lý các sự kiện, với các thông báo để giữ mọi người được thông báo.",
        "overview-04": "Cha mẹ có thể giám sát tiến trình học tập của con cái, bao gồm các môn học, học kỳ và điểm số, trực tiếp từ giao diện web.",
        "overview-05": "Ứng dụng web cũng cung cấp các cập nhật tin tức và tính năng trò chuyện gia đình, đảm bảo rằng tất cả các thành viên trong gia đình luôn được kết nối và thông tin."
      }
    },
    "technologies": {
      "backend": {
        "tech-01": "Được xây dựng với Nest.Js để đảm bảo các hoạt động phía máy chủ hiệu quả và mạnh mẽ, mang lại hiệu suất và độ tin cậy tối ưu.",
        "tech-02": "Tích hợp Socket.IO để cung cấp thông báo thời gian thực, giữ cho người dùng luôn được thông báo về các cập nhật.",
        "tech-03": "Sử dụng PostgreSQL để cung cấp các giải pháp lưu trữ dữ liệu đáng tin cậy và hiệu quả, đảm bảo tính toàn vẹn và khả năng truy cập dữ liệu.",
        "tech-04": "Tích hợp Redis để lưu trữ đệm và môi giới tin nhắn, nâng cao hiệu suất và khả năng mở rộng.",
        "tech-05": "Docker được sử dụng để container hóa, đảm bảo môi trường nhất quán trên các giai đoạn phát triển, kiểm thử và sản xuất.",
        "tech-06": "Kubernetes được sử dụng để điều phối container, đảm bảo quản lý hiệu quả các ứng dụng container hóa.",
        "tech-07": "Sử dụng Jenkins cho tích hợp liên tục và triển khai liên tục, đảm bảo quy trình làm việc mượt mà và tự động.",
        "tech-08": "Tích hợp Open Telemetry để quan sát, cung cấp thông tin chi tiết về hiệu suất và hành vi của hệ thống.",
        "tech-09": "Sử dụng GraphQL để truy vấn dữ liệu hiệu quả và linh hoạt, nâng cao trải nghiệm API."
      },
      "mobile": {
        "tech-01": "Được phát triển bằng React Native để tạo ra trải nghiệm ứng dụng di động liền mạch và trực quan.",
        "tech-02": "Sử dụng Expo để phát triển và triển khai ứng dụng di động một cách dễ dàng.",
        "tech-03": "Tích hợp Font Awesome để cung cấp một loạt các biểu tượng, nâng cao tính thẩm mỹ của ứng dụng.",
        "tech-04": "Tích hợp Socket.IO để cung cấp thông báo thời gian thực, giữ cho người dùng luôn được thông báo về các cập nhật."
      },
      "web": {
        "tech-01": "Tận dụng sức mạnh của React.Js để cung cấp giao diện người dùng hấp dẫn và phản hồi nhanh, nâng cao trải nghiệm người dùng tổng thể.",
        "tech-02": "Sử dụng Next.Js để render phía máy chủ và tạo trang tĩnh, cải thiện hiệu suất và SEO.",
        "tech-03": "Tích hợp Syncfusion để cung cấp một bộ thành phần UI toàn diện, nâng cao chức năng và giao diện của ứng dụng.",
        "tech-04": "Tận dụng sức mạnh của Ant Design để tạo ra giao diện người dùng hấp dẫn và phản hồi nhanh, thu hút người dùng và nâng cao trải nghiệm của họ.",
        "tech-05": "Tích hợp Socket.IO để cung cấp thông báo thời gian thực, giữ cho người dùng luôn được thông báo về các cập nhật."
      }
    }
  },
  "footer": {
    "copyright": "Bản quyền © 2025 Dương Phạm. Tất cả các quyền được bảo lưu",
    "design": "Thiết kế và phát triển bởi Dương Phạm",
    "title": "Dương Phạm"
  },
  "home": {
    "contact": "Liên hệ",
    "description": "Tôi là một kỹ sư phần mềm với niềm đam mê xây dựng ứng dụng web và giải quyết vấn đề. Tôi có kinh nghiệm làm việc với JavaScript, TypeScript, React, Node.js, và nhiều công nghệ khác.",
    "greeting": "Xin chào!",
    "job": "một Kỹ sư Phần mềm",
    "projects": "Dự án",
    "pronouns": "Tôi là"
  },
  "hotel-booking": {
    "description": "Ứng dụng web sáng tạo này cách mạng hóa cách người dùng đặt phòng khách sạn với sự dễ dàng và hiệu quả vượt trội. Được phát triển bằng các công nghệ tiên tiến như React, Node.js, Express.js và MongoDB, nó mang lại trải nghiệm người dùng liền mạch. Khách hàng có thể dễ dàng khám phá một loạt các phòng có sẵn, đặt chỗ ngay lập tức và theo dõi lịch sử đặt phòng của họ - tất cả trong một nơi. Hơn nữa, bảng điều khiển quản trị mạnh mẽ cho phép quản trị viên quản lý hiệu quả kho phòng và đặt phòng, đảm bảo hoạt động suôn sẻ. Trải nghiệm tương lai của việc đặt phòng khách sạn với ứng dụng xuất sắc này!",
    "overview": {
      "frontend": {
        "overview-01": "Khám phá sự tiện lợi của việc khám phá các căn hộ khách sạn mà không cần đăng nhập. Tuy nhiên, để đảm bảo đặt phòng của bạn và tận hưởng trải nghiệm liền mạch, chỉ cần đăng nhập khi bạn sẵn sàng đặt phòng.",
        "overview-02": "Khách có thể đánh giá các căn hộ khách sạn bằng hệ thống sao và chia sẻ nhận xét chi tiết về kỳ nghỉ của họ, giúp những khách hàng tương lai đưa ra quyết định sáng suốt. Phản hồi quý giá của bạn có thể cải thiện trải nghiệm cho mọi người!",
        "overview-03": "Quản lý và chủ khách sạn có cơ hội nâng cao khả năng hiển thị và thu hút nhiều khách hàng hơn bằng cách yêu cầu quyền truy cập để liệt kê doanh nghiệp của họ trên trang web của chúng tôi. Với quyền truy cập này, họ có thể dễ dàng thêm phòng, căn hộ và các dịch vụ bổ sung, tối đa hóa tiềm năng đặt phòng và đảm bảo trải nghiệm khách hàng liền mạch.",
        "overview-04": "Quản lý và chủ khách sạn có khả năng truy cập và xem danh sách đầy đủ các đặt phòng của khách hàng, giúp họ cải thiện dịch vụ và tối ưu hóa hoạt động.",
        "overview-05": "Quản trị viên đóng vai trò quan trọng trong việc quản lý tài khoản và phê duyệt các yêu cầu kinh doanh một cách quyết đoán, đảm bảo hoạt động suôn sẻ và thúc đẩy sự phát triển."
      }
    },
    "technologies": {
      "backend": {
        "tech-01": "Được thiết kế với Express.js, framework này đảm bảo hiệu quả vượt trội và các hoạt động phía máy chủ mạnh mẽ, mang lại hiệu suất không thể so sánh và độ tin cậy không ngừng.",
        "tech-02": "Được phát triển với Node.js, ứng dụng này cung cấp cơ sở hạ tầng backend mạnh mẽ và hiệu suất cao, đảm bảo khả năng mở rộng và tốc độ để đáp ứng nhu cầu của các ứng dụng hiện đại.",
        "tech-03": "Sử dụng MongoDB để cung cấp các giải pháp lưu trữ dữ liệu linh hoạt và có khả năng mở rộng cao, đảm bảo nhu cầu quản lý dữ liệu của bạn được đáp ứng một cách hiệu quả và đáng tin cậy."
      },
      "frontend": {
        "tech-01": "Tận dụng sức mạnh của Material UI để tạo ra giao diện người dùng hấp dẫn và phản hồi nhanh, nâng cao trải nghiệm của người dùng.",
        "tech-02": "Tận dụng sức mạnh của React.js để cung cấp giao diện người dùng hấp dẫn và phản hồi nhanh, nâng cao trải nghiệm người dùng tổng thể."
      }
    }
  },
  "list": {
    "about": "Giới thiệu",
    "contact": "Liên hệ",
    "education": "Học vấn",
    "experience": "Kinh nghiệm",
    "home": "Trang chủ",
    "projects": "Dự án"
  },
  "metadata": {
    "description": "Trang web cá nhân của Dương Phạm",
    "title": "Dương Phạm"
  },
  "my-shop": {
    "description": "Giới thiệu một ứng dụng Windows mạnh mẽ được phát triển chuyên nghiệp bằng C#, WPF và MSSQL Server, được thiết kế để tối ưu hóa việc quản lý sản phẩm và đơn hàng máy tính và PC của bạn. Với công cụ sáng tạo này, người dùng có thể dễ dàng áp dụng giảm giá và có được thông tin chi tiết có giá trị thông qua thống kê bán hàng toàn diện, giúp bạn tối ưu hóa hoạt động kinh doanh và thúc đẩy thành công.",
    "overview": {
      "frontend": {
        "overview-01": "Bảng điều khiển để xem tổng số sản phẩm, tổng số bán trong tuần và tháng, top 5 sản phẩm có số lượng ít nhất.",
        "overview-02": "Quản lý khách hàng hiệu quả và theo dõi chi tiết của họ.",
        "overview-03": "Quản lý danh mục sản phẩm để tổ chức kho hàng của bạn một cách hiệu quả.",
        "overview-04": "Quản lý sản phẩm, bao gồm thêm, cập nhật và xóa các mặt hàng.",
        "overview-05": "Quản lý đơn hàng, đảm bảo xử lý và theo dõi suôn sẻ.",
        "overview-06": "Quản lý giảm giá để cung cấp các chương trình khuyến mãi và ưu đãi đặc biệt.",
        "overview-07": "Thống kê (biểu đồ): doanh thu và lợi nhuận theo ngày, tuần, tháng và năm, tổng số sản phẩm bán ra theo ngày, tuần, tháng và năm.",
        "overview-08": "Lưu trữ và sao lưu cơ sở dữ liệu để đảm bảo tính toàn vẹn và bảo mật dữ liệu."
      }
    },
    "technologies": {
      "frontend": {
        "tech-01": "Tận dụng sức mạnh của WPF để cung cấp giao diện người dùng hấp dẫn và phản hồi nhanh, nâng cao trải nghiệm người dùng tổng thể.",
        "tech-02": "Sử dụng Entity Framework để cung cấp một lớp truy cập dữ liệu mạnh mẽ và hiệu quả, đảm bảo tương tác liền mạch với cơ sở dữ liệu.",
        "tech-03": "Tận dụng MSSQL Server để cung cấp các giải pháp lưu trữ dữ liệu đáng tin cậy và có khả năng mở rộng, đảm bảo tính toàn vẹn và khả năng truy cập dữ liệu."
      }
    }
  },
  "navbar": {
    "title": "Dương Phạm"
  },
  "online-academy": {
    "description": "Giới thiệu một nền tảng học trực tuyến sáng tạo, được chế tác chuyên nghiệp bằng Handlebars, Express và MongoDB. Ứng dụng này cung cấp cho người học một loạt các khóa học đa dạng trên nhiều chủ đề. Người dùng có thể dễ dàng đăng ký các khóa học, truy cập một kho tài liệu khóa học phong phú và nâng cao kiến thức của họ thông qua các bài kiểm tra và bài tập tương tác. Biến đổi trải nghiệm học tập của bạn và đạt được mục tiêu giáo dục của bạn với chúng tôi!",
    "overview": {
      "frontend": {
        "overview-01": "Học viên có thể dễ dàng đăng ký các khóa học và mở khóa kho tài liệu khóa học phong phú và hấp dẫn.",
        "overview-02": "Bằng cách tích cực tham gia vào các bài tập và bài kiểm tra, học viên có thể nâng cao trải nghiệm học tập của mình và hiểu sâu hơn về tài liệu.",
        "overview-03": "Giáo viên có thể dễ dàng tải lên và cập nhật các khóa học, đảm bảo rằng nội dung không chỉ hiện tại mà còn rất phù hợp với nhu cầu của học viên. Điều này giúp giáo viên nâng cao trải nghiệm học tập và đảm bảo tài liệu của họ luôn có tác động.",
        "overview-04": "Giáo viên có thể tương tác với học viên bằng cách đặt câu hỏi gợi mở và cung cấp phản hồi mang tính xây dựng, từ đó tạo ra một môi trường học tập năng động và hợp tác.",
        "overview-05": "Quản trị viên đóng vai trò then chốt trong việc nâng cao trải nghiệm học tập bằng cách quản lý hiệu quả các khóa học, người dùng và nội dung. Sự giám sát của họ đảm bảo một môi trường giáo dục liền mạch và hấp dẫn cho tất cả mọi người tham gia."
      }
    },
    "technologies": {
      "frontend": {
        "tech-01": "Tận dụng sức mạnh của Handlebars để tạo ra các mẫu động và hiệu quả cao, nâng cao trải nghiệm giao diện người dùng.",
        "tech-02": "Thiết kế tận dụng Bootstrap để tạo ra trải nghiệm động và trực quan, đảm bảo rằng nó vừa phản hồi vừa hấp dẫn đối với người dùng.",
        "tech-03": "Tận dụng sức mạnh của MongoDB để cung cấp các giải pháp lưu trữ dữ liệu linh hoạt và có khả năng mở rộng cao, đáp ứng nhu cầu phát triển của bạn."
      }
    }
  },
  "paint-app": {
    "description": "Giới thiệu một ứng dụng vẽ mạnh mẽ lấy cảm hứng từ Windows Paint yêu thích. Công cụ trực quan này cho phép người dùng thỏa sức sáng tạo, cung cấp các tính năng vẽ, xóa, thay đổi màu sắc và lưu tác phẩm nghệ thuật của họ một cách liền mạch. Được xây dựng bằng công nghệ tiên tiến sử dụng C#, WPF và XAML, ứng dụng này được thiết kế để nâng cao trải nghiệm nghệ thuật của bạn và biến tầm nhìn của bạn thành hiện thực.",
    "overview": {
      "frontend": {
        "overview-01": "Người dùng có thể dễ dàng vẽ các hình dạng khác nhau như hình chữ nhật, hình tròn và đường thẳng, sử dụng kiến trúc plugin để tăng cường tính linh hoạt và chức năng.",
        "overview-02": "Người dùng có khả năng xoay hình dạng, thay đổi kích thước và thay đổi màu sắc của các đường, cung cấp trải nghiệm vẽ tùy chỉnh cao.",
        "overview-03": "Ứng dụng cho phép người dùng thay đổi loại viền, chọn độ dày viền và áp dụng các kiểu khác nhau cho bản vẽ của họ.",
        "overview-04": "Người dùng có thể dễ dàng hoàn tác, làm lại, sao chép, sao chép và dán các yếu tố, đảm bảo quá trình vẽ liền mạch và hiệu quả.",
        "overview-05": "Giao diện trực quan và các tính năng mạnh mẽ giúp người dùng dễ dàng tạo và quản lý tác phẩm nghệ thuật của họ, nâng cao trải nghiệm sáng tạo tổng thể của họ."
      }
    },
    "technologies": {
      "frontend": {
        "tech-01": "Tận dụng sức mạnh của WPF để cung cấp giao diện người dùng hấp dẫn và phản hồi nhanh, nâng cao trải nghiệm người dùng tổng thể."
      }
    }
  },
  "projects": {
    "description": "Dưới đây là danh sách chi tiết các dự án cá nhân và dự án nhóm mà tôi đã đóng góp.",
    "title": "Dự án"
  },
  "video-sharing": {
    "description": "Giới thiệu một nền tảng chia sẻ video tiên tiến được phát triển bằng các công nghệ mới nhất, bao gồm React, Node.js, Express.js và MongoDB. Người dùng có thể dễ dàng tải lên video của họ, tương tác với nội dung thông qua lượt thích và chia sẻ, và đăng ký các kênh yêu thích của họ. Ứng dụng sáng tạo này là một bản sao mạnh mẽ của YouTube, được thiết kế để nâng cao trải nghiệm chia sẻ video của bạn và tạo ra một cộng đồng trực tuyến sôi động. Tham gia với chúng tôi và trở thành một phần của nền tảng năng động này!",
    "overview": {
      "frontend": {
        "overview-01": "Dễ dàng tải lên video của bạn và kết nối ngay lập tức với cộng đồng bằng cách chia sẻ sự sáng tạo của bạn!",
        "overview-02": "Tăng cường trải nghiệm của bạn bằng cách tích cực tương tác với nội dung thông qua lượt thích, chia sẻ và bình luận. Sự tham gia của bạn tạo nên sự khác biệt!",
        "overview-03": "Nâng cao trải nghiệm của bạn và không bỏ lỡ nội dung mới bằng cách đăng ký các kênh yêu thích của bạn."
      }
    },
    "technologies": {
      "backend": {
        "tech-01": "Được thiết kế với Express.js, framework này đảm bảo hiệu quả vượt trội và các hoạt động phía máy chủ mạnh mẽ, mang lại hiệu suất không thể so sánh và độ tin cậy không ngừng.",
        "tech-02": "Được phát triển với Node.js, ứng dụng này cung cấp cơ sở hạ tầng backend mạnh mẽ và hiệu suất cao, đảm bảo khả năng mở rộng và tốc độ để đáp ứng nhu cầu của các ứng dụng hiện đại.",
        "tech-03": "Sử dụng MongoDB để cung cấp các giải pháp lưu trữ dữ liệu linh hoạt và có khả năng mở rộng cao, đảm bảo nhu cầu quản lý dữ liệu của bạn được đáp ứng một cách hiệu quả và đáng tin cậy."
      },
      "frontend": {
        "tech-01": "Tận dụng sức mạnh của Material UI để tạo ra giao diện người dùng hấp dẫn và phản hồi nhanh, nâng cao trải nghiệm của người dùng.",
        "tech-02": "Tận dụng sức mạnh của React.js, chúng tôi cung cấp trải nghiệm người dùng tương tác và hấp dẫn, thu hút và giữ chân người dùng.",
        "tech-03": "Sử dụng Firebase để cung cấp đồng bộ hóa dữ liệu thời gian thực dễ dàng và các dịch vụ backend mạnh mẽ, đảm bảo trải nghiệm người dùng tuyệt vời và độ tin cậy."
      }
    }
  }
}
